hrshygoodness/Luminary-Micro-Library/boards/dk-lm3s9b96/drivers/set_pinout.c
#ifdef EPI_CONFIG_FPGA
    //
    // GPIO Port J pins
    //
    // If configuring for the FPGA daughter board, we need to make
    // EPI30 a normal GPIO so that it is available for use as the
    // interrupt line from the FPGA.
    //
    HWREG(GPIO_PORTJ_BASE + GPIO_O_PCTL) = GPIO_PCTL_PJ0_EPI0S16 |
                                           GPIO_PCTL_PJ1_EPI0S17 |
                                           GPIO_PCTL_PJ2_EPI0S18 |
                                           GPIO_PCTL_PJ3_EPI0S19 |
                                           GPIO_PCTL_PJ4_EPI0S28 |
                                           GPIO_PCTL_PJ5_EPI0S29;
#else
    //
    // GPIO Port J pins
    //
    HWREG(GPIO_PORTJ_BASE + GPIO_O_PCTL) = GPIO_PCTL_PJ0_EPI0S16 |
                                           GPIO_PCTL_PJ1_EPI0S17 |
                                           GPIO_PCTL_PJ2_EPI0S18 |
                                           GPIO_PCTL_PJ3_EPI0S19 |
                                           GPIO_PCTL_PJ4_EPI0S28 |
                                           GPIO_PCTL_PJ5_EPI0S29 |
                                           GPIO_PCTL_PJ6_EPI0S30;
#endif

    //
    // Configure pins and interface for the EPI-connected devices.
    //
    EPIPinConfigSet();

    //
    // It's somewhat unfortunate that this needs to be here since it breaks
    // the attempt to keep this file completely daughter-board agnostic but
    // the Camera/FPGA daughter board needs to be reset before it can be used
    // and, if we don't do it here, we end up with the problem of deciding how
    // to handle it if using both the camera and display driver for the board,
    // both of which could be used independently, both of which require that
    // the board has been reset but both of which get messed up if the other
    // resets the board after they are initialized.
    //
    if(g_eDaughterType == DAUGHTER_FPGA)
    {
        //
        // Configure the FPGA reset signal.
        //
        ROM_GPIOPinTypeGPIOOutput(GPIO_PORTH_BASE, GPIO_PIN_6);

        //
        // Configure the interrupt line from the FPGA.
        //
        ROM_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_6);

        //
        // Assert the FPGA reset for a while.
        //
        ROM_GPIOPinWrite(GPIO_PORTH_BASE, GPIO_PIN_6, 0);
        SysCtlDelay(10);
        ROM_GPIOPinWrite(GPIO_PORTH_BASE, GPIO_PIN_6, GPIO_PIN_6);

        //
        // Wait 600mS for the device to be completely ready.  This time
        // allows the FPGA to load its image from EEPROM after a power-on-
        // reset.
        //
        SysCtlDelay(ROM_SysCtlClockGet() / 5);

        //
        // Perform a write to the "read only" version register.  This is a
        // special case - the FPGA uses this access to determine whether it is
        // connected to a Tempest rev B or rev C.  The EPI timings are
        // different between these two revisions.
        //
        HWREGH(FPGA_VERSION_REG) = 0;
    }
}
#endif

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
